# coding=utf-8
# 说明：科龙空调

level123 = ((580, 500), (580, 1644))  # 数据123的0,1对应的电平
level4 = ((384, 442), (384, 1272))  # 数据4的0,1对应的电平


def getLevelsByByte(level, b):
    lvls = ()
    for i in range(7, -1, -1):
        lvls += level[((2**i) & b) >> i]
    return lvls


def getLevelsByData(level, s):
    lvls = ()
    for i in range(len(s)):
        lvls += getLevelsByByte(level, s[i])
    return lvls


def oc():  # open-cool-26d
    code = (9000, 4500)  # 引导码
    code += getLevelsByData(
        level123,
        [0b11000001, 0b01100000, 0b00100000, 0b01000001, 0b00000000, 0b00000000],
    )  # 数据1
    code += (580, 7850)  # 连接码
    code += getLevelsByData(
        level123,
        [
            0b00000001,
            0b00000000,
            0b00000000,
            0b00000000,
            0b00000100,
            0b00000000,
            0b00000100,
            0b01100000,
        ],
    )  # 数据2
    code += (580, 7850)  # 连接码
    code += getLevelsByData(
        level123,
        [
            0b00000000,
            0b10100100,
            0b00000000,
            0b00000000,
            0b00000100,
            0b00101000,
            0b10001000,
        ],
    )  # 数据3
    code += (540, 76800, 3340, 1700)
    code += getLevelsByData(
        level4,
        [
            0b00000010,
            0b00000000,
            0b00101000,
            0b00000001,
            0b11000010,
            0b10000001,
            0b00110100,
            0b00101111,
            0b11000000,
            0b00000000,
            0b00010110,
            0b00000000,
            0b00000000,
            0b10000000,
            0b00000000,
            0b00000000,
            0b00110010,
        ],
    )  # 数据4
    code += (375, 10000)  # 结束码
    return code


def cc():  # close-cool-26d
    code = (9000, 4500)  # 引导码
    code += getLevelsByData(
        level123,
        [0b11000001, 0b01100000, 0b00100000, 0b01000001, 0b00000000, 0b00000000],
    )  # 数据1
    code += (580, 7850)  # 连接码
    code += getLevelsByData(
        level123,
        [
            0b00000001,
            0b00000000,
            0b00000000,
            0b00000000,
            0b00000100,
            0b00000000,
            0b00000100,
            0b01100000,
        ],
    )  # 数据2
    code += (580, 7850)  # 连接码
    code += getLevelsByData(
        level123,
        [
            0b00000000,
            0b10100100,
            0b00000000,
            0b00000000,
            0b00001100,
            0b00101000,
            0b10000000,
        ],
    )  # 数据3
    code += (540, 76800, 3340, 1700)
    code += getLevelsByData(
        level4,
        [
            0b00000010,
            0b00000000,
            0b00101000,
            0b00000001,
            0b11000010,
            0b10000001,
            0b00110100,
            0b00101111,
            0b11000000,
            0b00000000,
            0b00010110,
            0b00000000,
            0b00000000,
            0b10000000,
            0b00000000,
            0b00000000,
            0b00110010,
        ],
    )  # 数据4
    code += (375, 10000)  # 结束码
    return code


def oh():  # open-heat-26d
    code = (9000, 4500)  # 引导码
    code += getLevelsByData(
        level123,
        [0b11000001, 0b01100000, 0b00100000, 0b00000001, 0b00000000, 0b00000000],
    )  # 数据1
    code += (580, 7850)  # 连接码
    code += getLevelsByData(
        level123,
        [
            0b00000001,
            0b00000000,
            0b00000000,
            0b00000000,
            0b00000100,
            0b00000000,
            0b01001000,
            0b01101100,
        ],
    )  # 数据2
    code += (580, 7850)  # 连接码
    code += getLevelsByData(
        level123,
        [
            0b00000000,
            0b10100100,
            0b00000000,
            0b00000000,
            0b00001100,
            0b00101000,
            0b10000000,
        ],
    )  # 数据3
    code += (540, 76800, 3340, 1700)
    code += getLevelsByData(
        level4,
        [
            0b00000010,
            0b00000000,
            0b00101000,
            0b00000001,
            0b11000010,
            0b01000010,
            0b00110100,
            0b00011011,
            0b11000100,
            0b00000000,
            0b00010110,
            0b00000000,
            0b00000000,
            0b10000000,
            0b00000000,
            0b00000000,
            0b10110010,
        ],
    )  # 数据4
    code += (375, 10000)  # 结束码
    return code


def ch():  # close-heat-26d
    code = (9000, 4500)  # 引导码
    code += getLevelsByData(
        level123,
        [0b11000001, 0b01100000, 0b00100000, 0b00000001, 0b00000000, 0b00000000],
    )  # 数据1
    code += (580, 7850)  # 连接码
    code += getLevelsByData(
        level123,
        [
            0b00000001,
            0b00000000,
            0b00000000,
            0b00000000,
            0b00000100,
            0b00000000,
            0b01001000,
            0b01101100,
        ],
    )  # 数据2
    code += (580, 7850)  # 连接码
    code += getLevelsByData(
        level123,
        [
            0b00000000,
            0b10100100,
            0b00000000,
            0b00000000,
            0b00000100,
            0b00101000,
            0b10001000,
        ],
    )  # 数据3
    code += (540, 76800, 3340, 1700)
    code += getLevelsByData(
        level4,
        [
            0b00000010,
            0b00000000,
            0b00101000,
            0b00000001,
            0b11000010,
            0b10000010,
            0b00110100,
            0b00011011,
            0b11000000,
            0b00000000,
            0b00010110,
            0b00000000,
            0b00000000,
            0b10000000,
            0b00000000,
            0b00000000,
            0b01010010,
        ],
    )  # 数据4
    code += (375, 10000)  # 结束码
    return code


if __name__ == "__main__":
    print("科龙空调抓码生成")
    print("电平码：")
    code = ch()
    print(code)
